{
  "common": {
    "name": "nspanel-lovelace-ui",
    "version": "0.7.3",
    "news": {
      "0.7.3": {
        "en": "Switch from global subscript to individual subscriptions\nmodel us-p fixed\nupdate deps",
        "de": "Wechsel vom globalen Subskript zu einzelnen Abonnements\nmodell us-p fixed\nupdate deps",
        "ru": "Переход от глобальной подписки к индивидуальной подписке\nмодель us-p фиксированная\nобновление deps",
        "pt": "Mudar de subscrito global para assinaturas individuais\nmodelo us-p fixo\natualizar deps",
        "nl": "Overschakelen van global subscript naar individuele abonnementen\nmodel us-p vast\nupdate deps",
        "fr": "Passer d'un abonnement global à un abonnement individuel\nmodèle us-p fixé\nmettre à jour les deps",
        "it": "Passare dal sottoscritto globale agli abbonamenti individuali\nmodello us-p fisso\naggiornamento dep",
        "es": "Cambiar de subscript global a suscripciones individuales\nmodelo us-p fijo\nactualización de los deps",
        "pl": "Przełączenie z subskrypcji globalnej na subskrypcje indywidualne\nmodel us- p stały\naktualizacje deps",
        "uk": "Переключення з глобального підряду на індивідуальні підписки\nмодель us-p фіксована\nоновлення deps",
        "zh-cn": "从全球下标切换到个人订阅\n模型我们 -p 固定\n更新代码"
      },
      "0.7.2": {
        "en": "selection disappears - fixed",
        "de": "auswahl verschwindet - fixiert",
        "ru": "выбор исчезает - фиксированный",
        "pt": "a seleção desaparece - fixa",
        "nl": "selectie verdwijnt - vast",
        "fr": "la sélection disparaît - fixe",
        "it": "selezione scompare - fisso",
        "es": "selección desaparece - fijo",
        "pl": "wybór znika - stałe",
        "uk": "вибір зникне - фіксована",
        "zh-cn": "选择消失 - 固定"
      },
      "0.7.1": {
        "en": "Initialise pageConfig",
        "de": "Initialisiere pageConfig",
        "ru": "Инициировать PageConfig",
        "pt": "Inicializar a páginaConfig",
        "nl": "Pagina initialiserenConfig",
        "fr": "Initialiser la pageConfig",
        "it": "Pagina inizialeConfig",
        "es": "Página inicialConfig",
        "pl": "Inicjalizować prezentację",
        "uk": "Початкова сторінкаConfig",
        "zh-cn": "初始化页面"
      },
      "0.7.0": {
        "en": "Enabled use of IDs in color specifications for pageItem and screensaver icons.\nAdmin: Adjust alarm settings\nAdmin: Reconfigure pageQR (BREAKING CHANGE)\nUpdated layout for page configuration",
        "de": "Verwendung von IDs in Farbangaben für pageItem- und Bildschirmschoner-Icons aktiviert.\nAdmin: Alarmeinstellungen anpassen\nAdmin: pageQR neu konfigurieren (BREAKING CHANGE)\nNeues Layout der Seitenkonfiguration",
        "ru": "Использование идентификаторов в цветовых спецификациях для значков PageItem и значков заставки включено.\nИсполнитель: Tweak alarm\nАдминистрирование: переделать конфигурацию PageQR (BREAKING)\nНовый макет конфигурации страницы",
        "pt": "Uso de IDs em especificações de cores para ícones do pageItem e ícones protetor de tela habilitados.\nAdministrador: ajustar o alarme\nAdministrador: refazer a configuração do QR da página (BREAKING)\nNova disposição da configuração da página",
        "nl": "Gebruik van ID's in kleurspecificaties voor paginaItem pictogrammen en screensaver pictogrammen ingeschakeld.\nBeheerder: tweak alarm\nBeheerder: opnieuw paginaQR-configuratie (BREAKING)\nNieuwe indeling van de paginaconfiguratie",
        "fr": "Utilisation d'ID dans les spécifications de couleur de la pageIcônes d'éléments et icônes d'écran activées.\nAdmin: alarme de réglage\nAdmin: remodeler la configuration QR de page (BREAKING)\nNouvelle configuration de la page",
        "it": "Utilizzo di ID nelle specifiche di colore per le icone di pageItem e screensaver abilitate.\nAdmin: Tweak allarme\nAdmin: redo pageQR configurazione (BREAKING)\nNuovo layout della configurazione della pagina",
        "es": "Uso de IDs en especificaciones de color para los iconos pageItem y salvapantallas habilitados.\nAdmin: alarma tweak\nAdmin: redo pageQR configuración (BREAKING)\nNuevo diseño de la configuración de la página",
        "pl": "Użycie identyfikatorów w specyfikacjach kolorystycznych dla ikon konkursów i ikon wygaszacza ekranu.\nAdmin: treak alarm\nAdmin: redo configuration paragon (BREAKING)\nNowy układ konfiguracji strony",
        "uk": "Використання ідентифікаторів у кольорових специфікаціях для сторінкиІдем іконок і екраніввих іконок.\nАдміністратор: сигналізація\nАдміністратор: конфігурація redo pageQR (BREAKING)\nНовий макет конфігурації сторінки",
        "zh-cn": "启用项目图标和屏幕保护图标在颜色规格中使用ID .\n管理员: 微调提醒\n管理员:重做页面QR配置( BREAKING)\n页面配置的新布局"
      },
      "0.6.8": {
        "en": "Error during conversion to fetch prevented adding of panels. Fixed.",
        "de": "Fehler bei der Umstellung auf Fetch verhinderte das Hinzufügen von Paneelen. Behoben.",
        "ru": "Ошибка во время преобразования в извлечение предотвратила добавление панелей. Исправлено.",
        "pt": "Erro durante a conversão para obter impediu a adição de painéis. Consertado.",
        "nl": "Fout tijdens de conversie naar fetch voorkomen toevoegen van panelen. Vast.",
        "fr": "Erreur lors de la conversion pour récupérer a empêché l'ajout de panneaux. Corrigé.",
        "it": "Errore durante la conversione a fetch ha impedito l'aggiunta di pannelli. Risolto.",
        "es": "Error durante la conversión para buscar evitaba añadir paneles. Arreglado.",
        "pl": "Błąd podczas konwersji do pobierania uniemożliwił dodanie paneli. Naprawione.",
        "uk": "Помилка при перетворенні на кисть, що запобігає доданням панелей. Фіксований.",
        "zh-cn": "在转换以获取时出错, 无法添加面板 。 固定着."
      },
      "0.6.7": {
        "en": "PagePower: Added favorite unit selection for power display\nGrid/Entities pages: Improved update performance with reduced minimum update interval\nPageItem icons: Enabled use of state IDs in color specifications\nChartBar: Fixed display issues\nBattery template (BYD HVS): Fixed charging status detection (power = 0 is no longer treated as charging)\nHMI: Fixed cardAlarm icon display and screensaver standard/alternate mode switching",
        "de": "PagePower: Favoriteneinheit für Leistungsanzeige hinzugefügt\nGrid/Entities-Seiten: Aktualisierungsleistung verbessert und minimale Aktualisierungsintervalle reduziert\nPageItem-Symbole: Verwendung von Zustands-IDs in Farbangaben aktiviert\nChartBar: Anzeigeprobleme behoben\nBatterievorlage (BYD HVS): Erkennung des Ladestatus korrigiert (Leistung = 0 wird nicht mehr als Laden behandelt)\nHMI: Anzeige des cardAlarm-Symbols und Umschaltung zwischen Standard-/Alternativmodus des Bildschirmschoners behoben",
        "ru": "PagePower: Добавлен любимый выбор блоков для отображения мощности\nСтраницы Grid/Entities: Улучшенная производительность обновления с минимальным интервалом обновления\nИконки PageItem: Возможность использования идентификаторов состояния в цветовых спецификациях\nChartBar: проблемы с фиксированным дисплеем\nШаблон батареи (BYD HVS): Определение состояния фиксированной зарядки (мощность = 0 больше не рассматривается как зарядка)\nHMI: Фиксированная карта Отображение значков тревоги и заставка стандартного / альтернативного режима переключения",
        "pt": "PagePower: Adicionado seleção de unidade favorita para exibição de energia\nPáginas de grade/entidades: Melhor desempenho de atualização com intervalo mínimo de atualização reduzido\nÍcones do PageItem: Utilização activa de IDs de estado nas especificações de cores\nBarra de Gráficos: Problemas de visualização corrigidos\nModelo da bateria (BYD HVS): Detecção do estado de carga fixa (potência = 0 já não é tratada como carga)\nHMI: Cartão fixo Exibição de ícones de alarme e screensaver padrão / mudança de modo",
        "nl": "PagePower: Toegevoegd favoriete eenheid selectie voor power display\nRaster/Entities pagina's: Verbeterde updateprestaties met een verminderd minimum updateinterval\nPageItem pictogrammen: Ingeschakeld gebruik van status ID's in kleurspecificaties\nGrafiekBar: Vaste weergave problemen\nModel batterij (BYD HVS): Detectie van vaste laadstatus (vermogen = 0 wordt niet langer behandeld als opladen)\nHMI: Vaste kaart Alarm pictogram display en screensaver standaard / alternatieve modus schakelen",
        "fr": "PagePower: Ajout de la sélection d'unité préférée pour l'affichage de puissance\nPages de grille/entités : Amélioration des performances de mise à jour avec un intervalle minimal de mise à jour réduit\nIcônes de page : Utilisation activée des ID d'état dans les spécifications de couleur\nBarre graphique : Correction des problèmes d'affichage\nModèle de batterie (BYD HVS): Détection de l'état de charge fixe (puissance = 0 n'est plus traitée comme charge)\nHMI: Carte fixe Affichage de l'icône d'alarme et commutation en mode standard / alternatif",
        "it": "PagePower: Aggiunta selezione unità preferita per display di potenza\nPagine di Griglia/Entities: Migliorate le prestazioni di aggiornamento con un ridotto intervallo di aggiornamento minimo\nIcone PageItem: Abilitato uso di ID di stato nelle specifiche di colore\nChartBar: Problemi di visualizzazione fissi\nModello della batteria (BYD HVS): Rilevamento di stato di carica fisso (la potenza = 0 non è più trattata come carica)\nHMI: Scheda fissa Visualizzazione icona di allarme e screensaver standard/alternate modalità di commutazione",
        "es": "PagePower: Añadido la selección de unidad favorita para la pantalla de energía\nPáginas de parrillas / entradas: Mejora del rendimiento de actualización con intervalo mínimo de actualización reducido\nPageItem iconos: Uso habilitado de IDs estatales en especificaciones de color\nChartBar: Problemas de visualización fijo\nPlantilla de batería (BYD HVS): Detección de estado de carga fija (poder = 0 ya no se trata como carga)\nHMI: Tarjeta fija Alarma icono pantalla y salvapantallas estándar / modo alternativo",
        "pl": "PagePower: Dodano ulubiony wybór jednostki dla wyświetlacza mocy\nStrony siatki / podmiotów: Lepsza wydajność aktualizacji z ograniczonym minimalnym odstępem aktualizacji\nIkony PageItem: Włączone użycie identyfikatorów stanu w specyfikacjach kolorów\nChartBar: Naprawiono problemy z wyświetlaniem\nWzór akumulatora (BYD HVS): Wykrywanie stanu ładowania stałego (moc = 0 nie jest już traktowana jako ładowanie)\nHMI: Karta stała Wyświetlacz ikon alarmu i wygaszacz ekranu",
        "uk": "PagePower: Додано вибір улюбленого блоку для дисплея живлення\nCайт: Покращено продуктивність оновлення з зменшеним інтервалом мінімального оновлення\nPageItem іконки: Увімкнено використання державних ідентифікаторів у кольорових специфікаціях\nChartBar: виправлені проблеми відображення\nШаблон батареї (BYD HVS): Виправлено визначення стану зарядки (потужність = 0 більше не лікується як зарядка)\nHMI: Фіксована картка Вимкнення значків сигналізації та екраніввих стандартних / змінних режимів",
        "zh-cn": "PagePower: 为权力显示添加了最喜欢的单位选择\n网格/实体页: 改进更新工作,缩短最低更新间隔\nPage 项目图标: 在颜色规格中允许使用状态标识\n图巴:固定显示问题\n电池模板( BYD HVS): 固定充电状态检测(功率=0不再作为充电处理)\nHMI:固定卡 提醒图标显示和屏幕保护标准/替换模式切换"
      },
      "0.6.6": {
        "en": "Chart: Added \"NO DATA\" label when chart has no data to display - fixes [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Fixed missing scale property - fixes [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nTemplates: Added Roborock vacuum status mapping template\nPageAlarm: Fixed race conditions on fast adapter restarts (timeout cleanup, unload checks)\nRefactor type definitions",
        "de": "Diagramm: \"NO DATA\"-Hinweis hinzugefügt, wenn das Diagramm keine Daten anzuzeigen hat – fixes [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nSeitenobjekt Info: Fehlende Skalierungseigenschaft behoben – fixes [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nVorlagen: Roborock-Staubsauger-Statusvorlage hinzugefügt\nPageAlarm: Race Conditions bei schnellen Adapter-Neustarts behoben (Timeout-Bereinigung, Unload-Prüfungen)\nRefactoring der Typdefinitionen",
        "ru": "Диаграмма: Добавлена метка «НЕ ДАННЫЕ», когда на графике нет данных для отображения - исправления [#471] (https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Fixed missing scale property - fixes [#532] (https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nШаблоны: Добавлен шаблон отображения состояния вакуума Roborock\nPageAlarm: фиксированные условия гонки на быстрых перезапусках адаптера (очистка тайм-аута, проверка разгрузки)\nОпределения типов рефакторов",
        "pt": "Gráfico: Adicionado rótulo \"NO DATA\" quando o gráfico não tem dados para exibir - correções [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Corrected missing scale property - fixes [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nModelos: Adicionado modelo de mapeamento de status de vácuo Robolock\nPageAlarm: Condições de corrida fixas no adaptador rápido reinicia (limpeza de tempo, verificações de descarga)\nDefinições do tipo de refator",
        "nl": "Grafiek: Toegevoegd label \"NO DATA\" wanneer de grafiek geen gegevens te tonen - fixes [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Vaste ontbrekende schaal eigenschap - fixes [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nSjablonen: Toegevoegd Roborock vacuüm status mapping template\nPageAlarm: Vaste racevoorwaarden op snelle adapter herstarten (timeout opruimen, uitladen controles)\nRefactortypedefinities",
        "fr": "Graphique : Ajout de l'étiquette « NON DONNEES » lorsque le graphique n'a pas de données à afficher - corrections [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Fixed absent scale property - corrections [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nModèles: Ajout d'un modèle de cartographie de l'état du vide Roborock\nPageAlarm: Conditions de course fixes sur les redémarrages rapides de l'adaptateur (nettoyage du temps écoulé, contrôle du déchargement)\nDéfinition du type de facteur",
        "it": "Grafico: Aggiunto l'etichetta \"NO DATA\" quando il grafico non ha dati da visualizzare - correzioni [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Proprietà in scala mancante fissa [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nTemplate: Aggiunto Roborock vuoto stato mapping modello\nPageAlarm: Condizioni di gara fissa su riavviamento rapido dell'adattatore (pulizia di timeout, controlli di scarico)\nDefinizioni di tipo refattore",
        "es": "Gráfico: Añadida etiqueta \"NO DATA\" cuando el gráfico no tiene datos que mostrar - fixes [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nPageItem info: Fixed missing scale property - fixes [#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\nPlantillas: Plantilla de asignación de estado de vacío de Roborock\nPageAlarm: Las condiciones de carrera fijas en el adaptador rápido se reinicia (con limpieza de tiempo, cheques de descarga)\nDefiniciones tipo refactor",
        "pl": "Wykres: Dodano etykietę \"NO DATA\", gdy wykres nie ma danych do wyświetlenia - poprawki [# 471] (https: / / github.com / ticaki / ioBroker.nspanel- lovelace- ui / issues / 471)\nPageItem info: Fixed missing scale property - fixes [# 532] (https: / / github.com / ticaki / ioBroker.nspanel- lovelace- ui / issues / 532)\nSzablony: Dodano szablon mapowania stanu podciśnienia Robock\nPageAlarm: Stałe warunki wyścigu przy ponownym uruchomieniu szybkiego adaptera (czyszczenie timeout, kontrola rozładunku)\nDefinicje typu reaktora",
        "uk": "Графік: Додано тег \"NO DATA\" при діаграмі не має даних для відображення - fixes [#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\nСторінкаItem інформація: Фіксована відсутня вага власності - виправлення [#532] (https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/products/532)\nШаблони: Додано шаблон вакуумного статусу Roborock\nPageAlarm: Виправлені умови забігу на швидкому перезаряджувачі адаптера (очищення від часу, перевірка вивантаження)\nВизначення типу рефактора",
        "zh-cn": "图:无数据显示时添加的“NO DATA”标签——修正[#471](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/471)\n项目信息:固定缺失比例尺财产 -- -- 修复[#532](https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/issues/532)\n模板:添加的Roborock真空状态映射模板\n页面提醒:快速适配器重启的固定赛车条件(超时清理,卸载检查)\n重构类型定义"
      }
    },
    "titleLang": {
      "en": "NSPanel-Lovelace-UI Next Level",
      "de": "NSPanel-Lovelace-UI Next Level",
      "ru": "Пользовательский интерфейс NSPanel Lovelace",
      "pt": "UI NSPanel Lovelace",
      "nl": "NSPanel Lovelace-gebruikersinterface",
      "fr": "Interface utilisateur NSPanel Lovelace",
      "it": "Interfaccia utente NPanel Lovelace",
      "es": "Interfaz de usuario de NSPanel Lovelace",
      "pl": "Interfejs NSPanel Lovelace",
      "uk": "Інтерфейс користувача NSPanel Lovelace",
      "zh-cn": "NSPanel Lovelace UI"
    },
    "desc": {
      "en": "NsPanel Lovelace UI is a Firmware for the nextion screen inside of NSPanel in the Design of Lovelace UI Design.",
      "de": "NsPanel Lovelace UI ist eine Firmware für den Nextion-Bildschirm innerhalb von NSPanel im Lovelace UI Design.",
      "ru": "NsPanel Lovelace UI — это прошивка для следующего экрана внутри NSPanel в дизайне Lovelace UI Design.",
      "pt": "NsPanel Lovelace UI é um firmware para a tela nextion dentro do NSPanel no Design of Lovelace UI Design.",
      "nl": "NsPanel Lovelace UI is een firmware voor het volgende scherm binnen NSPanel in het ontwerp van Lovelace UI Design.",
      "fr": "NsPanel Lovelace UI est un micrologiciel pour l'écran suivant à l'intérieur de NSPanel dans la conception de Lovelace UI Design.",
      "it": "NsPanel Lovelace UI è un firmware per la schermata successiva all'interno di NPanel nel design di Lovelace UI Design.",
      "es": "NsPanel Lovelace UI es un firmware para la siguiente pantalla dentro de NSPanel en el diseño de Lovelace UI Design.",
      "pl": "NsPanel Lovelace UI to oprogramowanie sprzętowe dla kolejnego ekranu wewnątrz NSPanel w projekcie Lovelace UI Design.",
      "uk": "NsPanel Lovelace UI — це прошивка для наступного екрана всередині NSPanel у дизайні Lovelace UI Design.",
      "zh-cn": "NsPanel Lovelace UI 是 Lovelace UI 设计中 NSPanel 内部下一个屏幕的固件。"
    },
    "authors": [
      "ticaki <github@renopoint.de>"
    ],
    "keywords": [
      "NSPanel",
      "Lovelace",
      "Sonoff",
      "Lovelace UI"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "nspanel-lovelace-ui.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/ticaki/ioBroker.nspanel-lovelace-ui/main/admin/nspanel-lovelace-ui.png",
    "readme": "https://github.com/ticaki/ioBroker.nspanel-lovelace-ui/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "hardware",
    "compact": true,
    "connectionType": "local",
    "dataSource": "push",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=7.0.6"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17",
        "javascript": ">=8.9.2"
      }
    ],
    "messagebox": true,
    "tier": 3
  },
  "protectedNative": [
    "mqttPassword",
    "pageQRssid",
    "pageQRpwd1",
    "pageQRpwd2",
    "pageQRpwd3",
    "tasmotaAdminPassword",
    "pw1"
  ],
  "encryptedNative": [
    "mqttPassword",
    "pageQRssid",
    "pageQRpwd1",
    "pageQRpwd2",
    "pageQRpwd3",
    "tasmotaAdminPassword",
    "pw1"
  ],
  "native": {
    "mqttPassword": "",
    "mqttUsername": "",
    "mqttIp": "",
    "mqttPort": 0,
    "panels": [],
    "pageQRpwd1": "",
    "pageQRpwd2": "",
    "pageQRpwd3": "",
    "pageQRssid": "",
    "pw1": "",
    "tasmotaAdminPassword": "",
    "useBetaTFT": false,
    "shutterClosedIsZero": false,
    "colorStates": [
      {
        "colGood": "#00ff00",
        "colBad": "#ff0000",
        "colTrue": "#00ff00",
        "colFalse": "#ff0000",
        "colActivated": "#ffff00",
        "colDeactivated": "#808080",
        "colAttention": "#00ffff",
        "colInfo": "#ffffff",
        "colOption1": "#ffff00",
        "colOption2": "#ffcc00",
        "colOption3": "#ff0000",
        "colOption4": "#00ff00",
        "colOpen": "#ff0000",
        "colClose": "#00ff00",
        "colHot": "#ff0000",
        "colCold": "#0000ff",
        "colOn": "#00ff00",
        "colOff": "#ff0000",
        "colLight": "#ffffff",
        "colDark": "#808080",
        "colWarning": "#ffa500",
        "colSuccess": "#00ff00",
        "colNeutral": "#808080",
        "colHighlight": "#00c8ff",
        "colDisabled": "#404040"
      }
    ],
    "colorNavigation": [
      {
        "colNavLeft": "#ffffff",
        "colNavRight": "#ffffff",
        "colNavDownLeft": "#ffffff",
        "colNavDownRight": "#ffffff",
        "colNavDown": "#ffffff",
        "colNavHome": "#ffffff",
        "colNavParent": "#ffffff"
      }
    ],
    "colorWeatherIcon": [
      {
        "colSunny": "#ffff00",
        "colPartlyCloudy": "#999999",
        "colCloudy": "#555555",
        "colFog": "#aaaaaa",
        "colHail": "#d0d0d0",
        "colLightning": "#ffff33",
        "colLightningRainy": "#cccc66",
        "colPouring": "#3333ff",
        "colRainy": "#6666ff",
        "colSnowy": "#cccccc",
        "colSnowyHeavy": "#bbbbbb",
        "colSnowyRainy": "#9999ff",
        "colWindy": "#999999",
        "colTornado": "#ff3232",
        "colClearNight": "#666666",
        "colExceptional": "#ff3232"
      }
    ],
    "colorDisplay": [
      {
        "colForeground": "#ffffff",
        "colBackground": "#101010"
      }
    ],
    "colorWeatherForecast": [
      {
        "colSolar": "#00ff00",
        "colTemperature": "#ff0000",
        "colGust": "#0000ff",
        "colSunrise": "#ffff00",
        "colSunset": "#ff9900"
      }
    ],
    "colorScreensaver": [
      {
        "colFgTime": "#ffffff",
        "colFgTimeAmPm": "#ffcc00",
        "colFgDate": "#c0c0c0",
        "colFgMain": "#ffffff",
        "colFgMainAlt": "#ffcc00",
        "colFgTimeAdd": "#00c8ff",
        "colFgForecast": "#c0c0c0",
        "colFgBar": "#c0c0c0"
      }
    ],
    "colorCardMedia": [
      {
        "colMediaArtistOn": "#ffff00",
        "colMediaArtistOff": "#808080",
        "colMediaTitleOn": "#ffff00",
        "colMediaTitleOff": "#808080",
        "colMediaOnOffColor": "#ffffff"
      }
    ]
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "keys",
      "type": "meta",
      "common": {
        "name": "keys",
        "role": "meta.user"
      },
      "native": {}
    }
  ]
}
